# =====================================================================
# Brewfile generated from nix-darwin flake + nix systemPackages mapping
# =====================================================================

# ---- Taps -----------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "atlassian/homebrew-acli"
tap "aerospace/homebrew"
tap "charmbracelet/homebrew"
tap "felixkratz/sketchybar"
tap "shivammathur/php"
tap "shivammathur/extensions"

# ---- Formulae (partial, expand as needed) ---------------------------
brew "brew"
brew "acli"
brew "aom"
brew "autoconf"
brew "bash-preexec"
brew "bat"
brew "ccache"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "elixir"
brew "erlang"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-lfs"
brew "go"
brew "jq"
brew "kubectl"
brew "luajit"
brew "make"
brew "mas"
brew "neovim"
brew "ninja"
brew "node"
brew "openssl@3"
brew "perl"
brew "pipx"
brew "postgresql"
brew "python@3.14"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "starship"
brew "stow"
brew "swift-format"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
brew "zsh"
brew "zoxide"
brew "zig"
brew "zstd"

# ---- Formulae mapped from nix environment.systemPackages ------------
# These are added manually; lines starting with # ⚠️ denote no Brew equivalent
brew "lemonade"                     # Clipboard sharing
brew "lorri"                        # Nix daemon helper
brew "nixd"                         # Nix language server
brew "nixfmt"                       # Nix formatter
brew "checkbashisms"                # Shell script checker
# ⚠️ mkalias                       # No formula (Nix utility)
# ⚠️ nsxiv                         # Not on macOS
# ⚠️ procps                        # Linux-only
# ⚠️ sqlar                         # No brew package
# ⚠️ sysz                          # No brew package
# ⚠️ taoup                         # No package
# ⚠️ tigerbeetle                   # Install manually (binary only)
# ⚠️ tix                           # Deprecated Tcl/Tk addon
# ⚠️ yamlscript                    # Not on Homebrew
brew "yt-dlp"                       # Closest to yt-dlg
brew "rakudo-star"                  # Contains zef (Raku)
# ⚠️ zunit                         # External tap only

# ---- Fonts ----------------------------------------------------------
tap "homebrew/cask-fonts"
cask "font-alegreya"
cask "font-iosevka"
cask "font-iosevka-comfy"
cask "font-open-dyslexic"
cask "font-overpass"

# ---- Applications (Casks) -------------------------------------------
cask "alfred"
cask "bbedit"
cask "bitwarden"
cask "blender"
cask "brewservicesmenubar"
cask "chatgpt"
cask "claude"
cask "cmake"
cask "cutter"
cask "devtoys"
cask "docker"
cask "emacs"
cask "expressvpn"
cask "flutter"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kitty"
cask "logseq"
cask "mactex"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "onedrive"
cask "orbstack"
cask "postman"
cask "qmlivebook" # example placeholder
cask "raycast"
cask "rstudio"
cask "slack"
cask "texstudio"
cask "visual-studio-code@insiders"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zoom"

# ---- Mac App Store apps (mas) --------------------------------------
mas "Amazon Kindle", id: 302584613
mas "Amazon Prime Video", id: 545519333
mas "Apple Configurator", id: 1037126344
mas "Apple Developer", id: 640199958
mas "Apple GarageBand", id: 682658836
mas "Apple Keynote", id: 409183694
mas "Apple Numbers", id: 409203825
mas "Apple Pages", id: 409201541
mas "Apple Swift Playgrounds", id: 1496833156
mas "Apple TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Slack", id: 803453959
mas "Messenger", id: 1480068668

# ---- Notes ----------------------------------------------------------
# • Save this file as Brewfile
# • Run:    brew bundle install
# • Items with ⚠️ have no macOS or brew equivalent; keep for reference.
# • Font taps need homebrew/cask-fonts enabled.

# =====================================================================
# End of Brewfile
# =====================================================================

