tap "aerospace/homebrew", "https://github.com/nikitabobko/homebrew-tap.git"
tap "atlassian/acli", "https://github.com/atlassian/homebrew-acli.git"
tap "atlassian/homebrew-acli"
tap "benjiwolff/neovim-nightly", "https://github.com/benjiwolff/homebrew-neovim-nightly.git"
tap "bufbuild/buf"
tap "charmbracelet/homebrew", "https://github.com/charmbracelet/homebrew-tap.git"
tap "dwt1/shell-color-scripts"
tap "felixkratz/sketchybar", "https://github.com/felixkratz/homebrew-formulae.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "netbirdio/tap"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "withgraphite/tap"
cask "aerospace/homebrew/aerospace"
cask "alfred"
cask "balenaetcher"
cask "bbedit"
cask "benjiwolff/neovim-nightly/neovim-nightly"
cask "beyond-compare"
cask "bitwarden"
cask "blender"
cask "blender-benchmark"
cask "brewservicesmenubar"
cask "chatgpt"
cask "cmake"
cask "crossover"
cask "cutter"
cask "devtoys"
cask "docker-desktop"
cask "dotnet-sdk"
cask "duckduckgo"
cask "dyalog"
cask "emacs-app"
cask "emojipedia"
cask "expressvpn"
cask "flutter"
cask "font-alegreya-sans"
cask "font-alegreya-sans-sc"
cask "font-alegreya-sc"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-open-dyslexic"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono-nerd-font"
cask "font-zed-sans"
cask "font-zen-antique-soft"
cask "font-zen-dots"
cask "font-zen-loop"
cask "git-credential-manager"
cask "gitbutler"
cask "github"
#cask "gitkraken"
#cask "gitkraken-cli"
cask "godot"
cask "godot-mono"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "herd"
cask "hex-fiend"
cask "iina"
cask "inkscape"
cask "insync"
cask "iterm2"
cask "itermai"
cask "jellyfin"
cask "jellyfin-media-player"
cask "jetbrains-gateway"
cask "jetbrains-space"
cask "jetbrains-toolbox"
cask "jupyterlab"
#cask "karabiner-elements"
cask "keycast"
cask "kitty"
cask "kodi"
cask "languagetool"
cask "launchcontrol"
cask "launchpad-manager"
cask "legcord"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "linear-linear"
cask "livebook"
cask "logitech-g-hub"
cask "lulu"
cask "macfuse"
cask "machoview"
cask "mactex"
cask "mediainfo"
cask "mediainfoex"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mpv"
cask "musescore"
cask "neovide"
cask "netbirdio/tap/netbird-ui"
cask "nextcloud"
cask "notesollama"
cask "notion"
cask "notion-calendar"
cask "notion-enhanced"
cask "obsidian"
cask "ollama"
cask "ollamac"
cask "onedrive"
cask "onyx"
cask "opera@beta"
cask "oracle-jdk"
cask "oracle-jdk-javadoc"
cask "orion"
cask "paragon-extfs"
cask "pgadmin4"
cask "porting-kit"
cask "postman"
cask "postman-agent"
cask "postman-cli"
cask "powershell"
cask "qownnotes"
cask "quarto"
cask "r"
cask "racket"
cask "raycast"
cask "rstudio"
cask "scribus"
cask "setapp"
cask "sf-symbols"
cask "skim"
cask "sloth"
cask "sqlitemanager"
cask "sqlitestudio"
cask "steam"
cask "steamcmd"
cask "streamlabs"
cask "swiftdefaultappsprefpane"
cask "swiftformat-for-xcode"
cask "tailscale-app"
cask "tex-live-utility"
cask "texstudio"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "vlc-setup"
cask "vlc-webplugin"
cask "vmware-fusion"
cask "wakatime"
cask "warp"
cask "wavebox"
cask "wezterm"
cask "whatsapp"
cask "windows-app"
cask "wireshark"
cask "xcodeclangformat"
cask "youtube-downloader"
cask "ytmdesktop-youtube-music"
cask "yubico-yubikey-manager"
cask "zen-browser"
cask "zenmap"
cask "zoom"
brew "acli"
brew "aom"
brew "armadillo"
brew "asciinema"
brew "aspell"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "autoenv"
brew "autogen"
brew "automake"
brew "bash-preexec"
brew "bash-preexec"
brew "bash_unit"
brew "bash_unit"
brew "bat"
brew "bat-extras"
brew "bats-core"
brew "bdw-gc"
brew "bear"
brew "bfg"
brew "binutils"
brew "bob"
brew "boost"
brew "bottom"
brew "brotli"
brew "btop"
brew "bufbuild/buf/buf"
brew "bzip2"
brew "c-ares"
brew "c2048"
brew "ca-certificates"
brew "ca-certificates"
brew "caddy"
brew "cairo"
brew "carapace"
brew "cargo-about"
brew "cargo-all-features"
brew "cargo-audit"
brew "cargo-auditable"
brew "cargo-binstall"
brew "cargo-binutils"
brew "cargo-bloat"
brew "cargo-bundle"
brew "cargo-c"
brew "cargo-crev"
brew "cargo-deny"
brew "cargo-depgraph"
brew "cargo-deps"
brew "cargo-docset"
brew "cargo-edit"
brew "cargo-fuzz"
brew "cargo-generate"
brew "cargo-instruments"
brew "cargo-llvm-cov"
brew "cargo-llvm-lines"
brew "cargo-make"
brew "cargo-nextest"
brew "cargo-outdated"
brew "cargo-release"
brew "cargo-sweep"
brew "cargo-udeps"
brew "cargo-watch"
brew "cargo-zigbuild"
brew "ccache"
brew "ccls"
brew "chafa"
brew "charmbracelet/homebrew/charm"
brew "charmbracelet/homebrew/confettysh"
brew "charmbracelet/homebrew/crush"
brew "charmbracelet/homebrew/freeze"
brew "charmbracelet/homebrew/glow"
brew "charmbracelet/homebrew/gum"
brew "charmbracelet/homebrew/markscribe"
brew "charmbracelet/homebrew/melt"
brew "charmbracelet/homebrew/mods"
brew "charmbracelet/homebrew/pop"
brew "charmbracelet/homebrew/sequin"
brew "charmbracelet/homebrew/skate"
brew "charmbracelet/homebrew/soft-serve"
brew "charmbracelet/homebrew/vhs"
brew "charmbracelet/homebrew/wishlist"
brew "chruby"
brew "clang-build-analyzer"
brew "clang-format"
brew "clang-uml"
brew "clangql"
brew "clipboard"
brew "clojure"
brew "clojure-lsp"
brew "clojurescript"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "cpanminus"
brew "curl"
brew "curlie"
brew "deno"
brew "devscripts"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "dooit"
brew "dotenv-linter"
brew "duti"
brew "dwt1/shell-color-scripts/shell-color-scripts"
brew "e2fsprogs"
brew "editorconfig"
brew "editorconfig-checker"
brew "elixir"
brew "elixir-ls"
brew "erlang"
brew "erlang_ls"
brew "evil-helix"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "felixkratz/sketchybar/borders"
brew "felixkratz/sketchybar/sketchybar"
brew "felixkratz/sketchybar/svim"
brew "ffmpeg"
brew "ffmpeg2theora"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "fish"
brew "fisher"
brew "fizsh"
brew "flyctl"
brew "fnm"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "fzf-make"
brew "gawk"
brew "gcc"
brew "gdu"
brew "gettext"
brew "gh"
brew "ghcup"
brew "ghostscript"
brew "giflib"
brew "gifsicle"
brew "gist"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-flow"
brew "git-gui"
brew "git-lfs"
brew "git-plus"
brew "git-tools"
brew "gitui"
brew "gleam"
brew "glib"
brew "gmime"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "gnutls"
brew "go"
brew "gopls"
brew "gpa"
brew "gpatch"
brew "gpg-tui"
brew "gpgme"
brew "graphite2"
brew "graphviz"
brew "greed"
brew "grep"
brew "gsl"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "highway"
brew "icu4c@76"
brew "ifstat"
brew "ijq"
brew "imagemagick"
brew "imath"
brew "imlib2"
brew "isl"
brew "jasper"
brew "jbig2dec"
brew "jj"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jpegoptim"
brew "jq"
brew "json-c"
brew "juliaup"
brew "kanata"
brew "ktlint"
brew "kubectl"
brew "kubernetes-cli"
brew "kubetui"
brew "lazycli"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lemonade"
brew "leptonica"
brew "less"
brew "lesspipe"
brew "libarchive"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libcaca"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgit2@1.7"
brew "libgpg-error"
brew "libheif"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmpc"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libraw"
brew "libsql"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyubikey"
brew "lilypond"
brew "little-cms2"
brew "llvm"
brew "lmdb"
brew "lolcat"
brew "lpeg"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "luajit"
brew "luarocks"
brew "luv"
brew "lynx"
brew "lz4"
brew "lzo"
brew "m4"
brew "make"
brew "markdown-oxide"
brew "marksman"
brew "mas"
brew "mediainfo"
brew "micro"
brew "mkalias"
brew "mmv"
brew "mongosh"
brew "mpc"
brew "mpd", link: true, restart_service: true, start_service: true
brew "mpdecimal"
brew "mpfr"
brew "mplayer"
brew "msgpack"
brew "nasm"
brew "nbsdgames"
brew "ncurses"
brew "neofetch"
brew "neomutt"
brew "neovim"   #, link: false, restart_service: false, start_service: false
brew "nethack"
brew "nettle"
brew "newsboat"
brew "ninja"
brew "ninvaders"
brew "nixfmt"
brew "notcurses"
brew "notmuch"
brew "nowplaying-cli"
brew "npth"
brew "nsxiv"
brew "nudoku"
brew "nushell"
brew "nvm"
brew "openexr"
brew "openjpeg"
brew "openssh"
brew "openssl@3"
brew "optipng"
brew "ormolu"
brew "oven-sh/bun/bun"
brew "p11-kit"
brew "pango"
brew "parallel"
brew "pcre"
brew "pcre2"
brew "perl"
brew "php"
brew "phpactor"
brew "pinentry"
brew "pinentry-mac"
brew "pipx"
brew "pixman"
brew "pkg-config"
brew "pngpaste"
brew "pngquant"
brew "poppler"
brew "portaudio"
brew "posting"
brew "prettier"
brew "procs"
brew "proctools"
brew "progress"
brew "progressline"
brew "pycparser"
brew "python-build"
brew "python-gdbm@3.13"
brew "python-launcher"
brew "python-lsp-server"
brew "python-markdown"
brew "python-matplotlib"
brew "python-packaging"
brew "python-setuptools"
brew "python-tabulate"
brew "python-tk@3.13"
brew "python@3.13"
brew "rakudo"
brew "rakudo-star"
brew "readline"
brew "rebar3"
brew "ripgrep-all"
brew "rlwrap"
brew "rtmpdump"
brew "ruby"
brew "ruby-build"
brew "ruby-completion"
brew "ruby-install"
brew "rubyfmt"
brew "rustup"
brew "sassc"
brew "screen"
brew "screenfetch"
brew "screenresolution"
brew "semgrep"
brew "shared-mime-info"
brew "sheldon"
brew "shellcheck"
brew "shellharden"
brew "shellspec"
brew "shfmt"
brew "shivammathur/extensions/apcu@8.4"
brew "shivammathur/extensions/event@8.4"
brew "shivammathur/extensions/expect@8.4"
brew "shivammathur/extensions/igbinary@8.4"
brew "shivammathur/extensions/imagick@8.4"
brew "shivammathur/extensions/msgpack@8.4"
brew "shivammathur/extensions/opentelemetry@8.4"
brew "shivammathur/extensions/pcov@8.4"
brew "shivammathur/extensions/pecl_http@8.4"
brew "shivammathur/extensions/psr@8.4"
brew "shivammathur/extensions/raphf@8.4"
brew "shivammathur/extensions/redis@8.4"
brew "shivammathur/extensions/uuid@8.4"
brew "shivammathur/extensions/xdebug@8.4"
brew "shivammathur/extensions/yaml@8.4"
brew "shivammathur/extensions/zstd@8.4"
brew "shivammathur/php/php@8.4", link: true, restart_service: false, start_service: false
brew "spatialite-gui"
brew "spatialite-tools"
brew "speedtest-cli"
brew "sql-language-server"
brew "sqlcipher"
brew "sqldiff"
brew "sqlite"
brew "sqlite-analyzer"
brew "sqlite-utils"
brew "starship"
brew "stow"
brew "stylelint"
brew "stylua"
brew "supervisor"
brew "svgo"
brew "swift-format"
brew "switchaudio-osx"
brew "sysz"
brew "tailwindcss"
brew "tailwindcss-language-server"
brew "talloc"
brew "tcl-tk"
brew "tealdeer"
brew "terraform"
brew "tesseract"
brew "texi2html"
brew "texinfo"
brew "texlab"
brew "texlive"
brew "tig"
brew "tigerbeetle"
brew "tix"
brew "tmux"
brew "tokyo-cabinet"
brew "trash-cli"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unar"
brew "unbound"
brew "unibilium"
brew "unzip"
brew "vivid"
brew "w3m"
brew "webp"
brew "wget"
brew "wimlib"
brew "wireguard-go"
brew "wireguard-tools"
brew "withgraphite/tap/graphite"
brew "x265"
brew "xapian"
brew "xclip"
brew "xdg-ninja"
brew "xorgproto"
brew "xsel"
brew "xz"
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"
brew "yazi"
brew "ykpers"
brew "yq"
brew "yt-dlp"
brew "yt-dlp"
brew "yubico-piv-tool"
brew "yubikey-agent"
brew "z3"
brew "zellij"
brew "zh"
brew "zig"
brew "zigmod"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-lovers"
brew "zshdb"
brew "zstd"
