# Brewfile generated from nix-darwin flake Fri 24 Oct 2025 23:02:04 BST
# =====================================================================

# ---- Taps -----------------------------------------------------------
tap "="
tap "aerospace/homebrew"
tap "atlassian/homebrew-acli"
tap "charmbracelet/homebrew"
tap "felixkratz/sketchybar"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/homebrew-bundle"
tap "homebrew/homebrew-cask"
tap "homebrew/homebrew-core"
tap "homebrew/homebrew-services"
tap "shivammathur/extensions"
tap "shivammathur/homebrew-extensions"
tap "shivammathur/homebrew-php"
tap "shivammathur/php"

# ---- Formulae -------------------------------------------------------
brew "acli"
brew "agg"
brew "aom"
brew "armadillo"
brew "asciinema"
brew "asciiquarium"
brew "aspell"
brew "atuin"
brew "autoconf-archive"
brew "autoconf"
brew "autoenv"
brew "autogen"
brew "automake"
brew "bash_unit"
brew "bash-preexec"
brew "bat-extras"
brew "bat"
brew "bats-core"
brew "bdw-gc"
brew "bear"
brew "bfg"
brew "binutils"
brew "bob"
brew "boost"
brew "bottom"
brew "brew"
brew "brotli"
brew "btop"
brew "bufbuild/buf/buf"
brew "bzip2"
brew "c-ares"
brew "c2048"
brew "ca-certificates"
brew "caddy"
brew "cairo"
brew "carapace"
brew "cargo-about"
brew "cargo-all-features"
brew "cargo-audit"
brew "cargo-auditable"
brew "cargo-binstall"
brew "cargo-binutils"
brew "cargo-bloat"
brew "cargo-bundle"
brew "cargo-c"
brew "cargo-crev"
brew "cargo-deny"
brew "cargo-depgraph"
brew "cargo-deps"
brew "cargo-docset"
brew "cargo-edit"
brew "cargo-fuzz"
brew "cargo-generate"
brew "cargo-instruments"
brew "cargo-llvm-cov"
brew "cargo-llvm-lines"
brew "cargo-make"
brew "cargo-nextest"
brew "cargo-outdated"
brew "cargo-release"
brew "cargo-sweep"
brew "cargo-udeps"
brew "cargo-watch"
brew "cargo-zigbuild"
brew "cbonsai"
brew "ccache"
brew "ccls"
brew "chafa"
brew "charmbracelet/homebrew/charm"
brew "charmbracelet/homebrew/confettysh"
brew "charmbracelet/homebrew/crush"
brew "charmbracelet/homebrew/freeze"
brew "charmbracelet/homebrew/glow"
brew "charmbracelet/homebrew/gum"
brew "charmbracelet/homebrew/markscribe"
brew "charmbracelet/homebrew/melt"
brew "charmbracelet/homebrew/mods"
brew "charmbracelet/homebrew/pop"
brew "charmbracelet/homebrew/sequin"
brew "charmbracelet/homebrew/skate"
brew "charmbracelet/homebrew/soft-serve"
brew "charmbracelet/homebrew/vhs"
brew "charmbracelet/homebrew/wishlist"
brew "chruby"
brew "clang-build-analyzer"
brew "clang-format"
brew "clang-uml"
brew "clangql"
brew "clipboard"
brew "clojure-lsp"
brew "clojure"
brew "clojurescript"
brew "cmatrix"
brew "codex"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "cpanminus"
brew "croc"
brew "curl"
brew "curlie"
brew "deno"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "dooit"
brew "dotenv-linter"
brew "duti"
brew "e2fsprogs"
brew "editorconfig-checker"
brew "editorconfig"
brew "elixir-ls"
brew "elixir"
brew "erlang_ls"
brew "erlang"
brew "evil-helix"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "ffmpeg2theora"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "fish"
brew "fisher"
brew "fizsh"
brew "flyctl"
brew "fnm"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fribidi"
brew "fzf-make"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdu"
brew "gemini-cli"
brew "gettext"
brew "gh"
brew "ghcup"
brew "ghostscript"
brew "giflib"
brew "gifsicle"
brew "gist"
brew "git-extras"
brew "git-filter-repo"
brew "git-flow"
brew "git-gui"
brew "git-lfs"
brew "git-plus"
brew "git-tools"
brew "git"
brew "gitui"
brew "gleam"
brew "glib"
brew "gmime"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "gnutls"
brew "go"
brew "gopls"
brew "gpa"
brew "gpatch"
brew "gpg-tui"
brew "gpgme"
brew "graphite2"
brew "graphviz"
brew "greed"
brew "grep"
brew "gsl"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "highway"
brew "icu4c@77"
brew "ifstat"
brew "ijq"
brew "imagemagick"
brew "imath"
brew "imlib2"
brew "isl"
brew "jasper"
brew "jbig2dec"
brew "jj"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jpegoptim"
brew "jq"
brew "json-c"
brew "juliaup"
brew "ktlint"
brew "kubectl"
brew "kubernetes-cli"
brew "kubetui"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazysql"
brew "leptonica"
brew "less"
brew "lesspipe"
brew "libarchive"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libcaca"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libheif"
brew "libiconv"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmpc"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libraw"
brew "libsql"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyubikey"
brew "lilypond"
brew "little-cms2"
brew "lmdb"
brew "lolcat"
brew "lpeg"
brew "lsd"
brew "lua-language-server"
brew "lua"
brew "luacheck"
brew "luajit"
brew "luarocks"
brew "luv"
brew "lynx"
brew "lz4"
brew "lzo"
brew "m4"
brew "make"
brew "markdown-oxide"
brew "marksman"
brew "mas"
brew "mediainfo"
brew "micro"
brew "mmv"
brew "mongosh"
brew "mpc"
brew "mpdecimal"
brew "mpfr"
brew "mplayer"
brew "msgpack"
brew "nasm"
brew "nbsdgames"
brew "ncurses"
brew "neofetch"
brew "neomutt"
brew "nethack"
brew "nettle"
brew "newsboat"
brew "ninja"
brew "ninvaders"
brew "notcurses"
brew "notmuch"
brew "nowplaying-cli"
brew "npth"
brew "nudoku"
brew "nushell"
brew "nvm"
brew "opencode"
brew "openexr"
brew "openjpeg"
brew "openssh"
brew "openssl@3"
brew "optipng"
brew "ormolu"
brew "p11-kit"
brew "pango"
brew "parallel"
brew "pcre"
brew "pcre2"
brew "perl"
brew "withgraphite/tap/graphite"

# ---- Casks ----------------------------------------------------------
cask "aerospace/homebrew/aerospace"
cask "alfred"
cask "balenaetcher"
cask "bbedit"
cask "beyond-compare"
cask "bitwarden"
cask "blender-benchmark"
cask "blender"
cask "brewservicesmenubar"
cask "chatgpt"
cask "claude-code"
cask "claude"
cask "cmake-app"
cask "crossover"
cask "cutter"
cask "devtoys"
cask "dotnet-sdk"
cask "duckduckgo"
cask "dyalog"
cask "emacs-app"
cask "emojipedia"
cask "expressvpn"
cask "flutter"
cask "font-alegreya-sans-sc"
cask "font-alegreya-sans"
cask "font-alegreya-sc"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-open-dyslexic-nerd-font"
cask "font-open-dyslexic"
cask "font-overpass-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono-nerd-font"
cask "font-zed-sans"
cask "font-zen-antique-soft"
cask "font-zen-dots"
cask "font-zen-loop"
cask "git-credential-manager"
cask "github"
cask "godot-mono"
cask "godot"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "herd"
cask "hex-fiend"
cask "iina"
cask "inkscape"
cask "insync"
cask "iterm2"
cask "itermai"
cask "jellyfin-media-player"
cask "jellyfin"
cask "jetbrains-gateway"
cask "jetbrains-space"
cask "jetbrains-toolbox"
cask "jupyterlab-app"
cask "karabiner-elements"
cask "keycast"
cask "kitty"
cask "kodi"
cask "languagetool-desktop"
cask "launchcontrol"
cask "launchpad-manager"
cask "legcord"
cask "libreoffice-language-pack"
cask "libreoffice"
cask "linear-linear"
cask "livebook"
cask "logitech-g-hub"
cask "logseq"
cask "lulu"
cask "macfuse"
cask "machoview"
cask "mactex"
cask "mediainfo"
cask "mediainfoex"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "musescore"
cask "neovide-app"
cask "netbirdio/tap/netbird-ui"
cask "nextcloud"
cask "notesollama"
cask "notion-calendar"
cask "notion-enhanced"
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "ollamac"
cask "onedrive"
cask "onyx"
cask "oracle-jdk"
cask "orbstack"
cask "orion"
cask "pgadmin4"
cask "podman-desktop"
cask "podman-tui"
cask "porting-kit"
cask "postman-agent"
cask "postman-cli"
cask "postman"
cask "powershell"
cask "qownnotes"
cask "quarto"
cask "r-app"
cask "racket"
cask "raycast"
cask "rstudio"
cask "scribus"
cask "setapp"
cask "sf-symbols"
cask "skim"
cask "sloth"
cask "sqlitemanager"
cask "sqlitestudio"
cask "steam"
cask "steamcmd"
cask "stolendata-mpv"
cask "streamlabs"
cask "swiftdefaultappsprefpane"
cask "swiftformat-for-xcode"
cask "tailscale-app"
cask "tex-live-utility"
cask "texstudio"
cask "the-unarchiver"
cask "visual-studio-code@insiders"
cask "vivid-app"
cask "vlc-setup"
cask "vlc-webplugin"
cask "vlc"
cask "vmware-fusion"
cask "wakatime"
cask "warp"
cask "wavebox"
cask "wezterm"
cask "whatsapp"
cask "windows-app"
cask "wireshark-app"
cask "xcodeclangformat"
cask "youtube-downloader"
cask "ytmdesktop-youtube-music"
cask "yubico-yubikey-manager"
cask "zen"
cask "zenmap"
cask "zoom"

# ---- MAS Apps -------------------------------------------------------
mas "Amazon Kindle", id: 302584613
mas "Amazon Prime Video", id: 545519333
mas "Apple Configurator", id: 1037126344
mas "Apple Develooper", id: 640199958
mas "Apple GarageBand", id: 682658836
mas "Apple Keynote", id: 409183694
mas "Apple Numbers", id: 409203825
mas "Apple Pages", id: 409201541
mas "Apple Swift Playgrounds", id: 1496833156
mas "Apple Testflight", id: 899247664
mas "Apple Transporter", id: 1450874784
mas "Messenger", id: 1480068668
mas "Slack", id: 803453959
mas "Smart JSON Editor", id: 1268962404
mas "Testflight", id: 899247664
mas "Ultra CharMap", id: 520265986
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835

# ---- Apps without MAS IDs (installed via Brew/Cask/Nix) -------------
# alfred
# balenaetcher
# bbedit
# bitwarden
# blender
# brewservicesmenubar
# chatgpt
# claude
# crossover
# cutter
# devtoys
# duckduckgo
# dyalog
# emojipedia
# expressvpn
# flutter
# github
# # gitkraken
# godot
# hammerspoon
# herd
# iina
# inkscape
# insync
# itermai
# jellyfin
# keycast
# kitty
# kodi
# launchcontrol
# legcord
# libreoffice
# livebook
# logseq
# lulu
# macfuse
# machoview
# mactex
# mediainfo
# mediainfoex
# meetingbar
# messenger
# musescore
# nextcloud
# notesollama
# notion
# obsidian
# ollamac
# onedrive
# onyx
# orbstack
# orion
# postman
# powershell
# qownnotes
# quarto
# racket
# raycast
# rstudio
# scribus
# setapp
# skim
# sloth
# sqlitemanager
# sqlitestudio
# steam
# steamcmd
# streamlabs
# swiftdefaultappsprefpane
# texstudio
# vlc
# wakatime
# warp
# wavebox
# wezterm
# whatsapp
# xcodeclangformat
# zen
# zenmap
# zoom
# brew
# acli
# agg
# aom
# armadillo
# asciinema
# asciiquarium
# aspell
# atuin
# autoconf
# autoenv
# autogen
# automake
# bat
# bear
# bfg
# binutils
# bob
# boost
# bottom
# brotli
# btop
# caddy
# cairo
# carapace
# cbonsai
# ccache
# ccls
# chafa
# chruby
# clangql
# clipboard
# clojure
# clojurescript
# cmatrix
# codex
# colima
# coreutils
# cowsay
# cpanminus
# croc
# curl
# curlie
# deno
# dialog
# direnv
# dooit
# duti
# editorconfig
# elixir
# erlang
# exercism
# exiftool
# eza
# fastfetch
# fd
# ffmpeg
# ffmpegthumbnailer
# figlet
# findutils
# fish
# fisher
# fizsh
# flyctl
# fnm
# fontconfig
# fortune
# freetype
# fribidi
# fzf
# gawk
# gcc
# gdu
# gettext
# gh
# ghcup
# ghostscript
# giflib
# gifsicle
# gist
# git
# gitui
# gleam
# glib
# gmime
# gmp
# gnupg
# gnuplot
# gnutls
# go
# gopls
# gpa
# gpatch
# gpgme
# graphviz
# greed
# grep
# gsl
# guile
# harfbuzz
# highway
# ifstat
# ijq
# imagemagick
# imath
# isl
# jasper
# jj
# jpegoptim
# jq
# juliaup
# ktlint
# kubectl
# kubetui
# leptonica
# lazydocker
# lazygit
# lazyjj
# lazysql
# less
# lesspipe
# lilypond
# libarchive
# libassuan
# libavif
# libcaca
# libdeflate
# libevent
# libgcrypt
# libheif
# libiconv
# libidn
# libksba
# liblqr
# libmpc
# libomp
# libpng
# libraw
# libsql
# libtiff
# libtool
# libunistring
# libusb
# libuv
# libvmaf
# libvterm
# libxau
# libxcb
# libxdmcp
# libxext
# libxrender
# libyubikey
# lmdb
# lolcat
# lpeg
# lsd
# lua
# luacheck
# luajit
# luarocks
# luv
# lynx
# lzo
# make
# marksman
# mas
# mediainfo
# micro
# mmv
# mongosh
# mpc
# name
# mpdecimal
# mpfr
# mplayer
# msgpack
# nasm
# nbsdgames
# ncurses
# neofetch
# neomutt
# #     name
# nethack
# nettle
# newsboat
# ninja
# ninvaders
# notcurses
# notmuch
# npth
# nudoku
# nushell
# nvm
# opencode
# openexr
# openjpeg
# openssh
# optipng
# ormolu
# pango
# parallel
# pcre
# perl
# pinentry
# pipx
# pixman
# pngpaste
# pngquant
# portaudio
# poppler
# posting
# prettier
# procs
# proctools
# progress
# progressline
# pycparser
# uv
# readline
# rlwrap
# rtmpdump
# ruby
# rubyfmt
# sassc
# screen
# screenfetch
# screenresolution
# semgrep
# sheldon
# shellcheck
# shellharden
# shellspec
# shfmt
# sqlcipher
# sqldiff
# sqlite
# starship
# stow
# stylelint
# stylua
# supervisor
# svgo
# tailwindcss
# talloc
# tealdeer
# teller
# terraform
# tesseract
# texinfo
# texlab
# texlive
# tig
# tmux
# tree
# unar
# unbound
# unibilium
# unzip
# vivid
# webp
# wget
# wimlib
# xapian
# xclip
# xh
# xorgproto
# xsel
# xxh
# xz
# yamlfmt
# yamllint
# yazi
# ykpers
# yq
# zellij
# zig
# zigmod
# zlib
# zoxide
# zsh
# zshdb
# zstd
# root
# ${pkgs.mkalias}/bin/mkalias $src /Applications/Nix Apps/$app_name
# AppleInterfaceStyle
# AppleWindowTabbingMode
# mineffect
# FXPreferredViewStyle
# MouseButtonMode

# ---- Nix systemPackages equivalents ---------------------------------
brew "any-nix-shell"
brew "checkbashisms"
brew "lemonade"
brew "lorri"
brew "nixd"
brew "nixfmt"
brew "yt-dlp"
brew "rakudo-star"   # includes zef

# ⚠️ The following have no direct Homebrew equivalent; they are kept as comments.
# brew "mkalias"
# brew "nix-zsh-completions"
# brew "nsxiv"
# brew "procps"
# brew "sqlar"
# brew "sysz"
# brew "taoup"
# brew "tigerbeetle"
# brew "tix"
# brew "yamlscript"

# ---- Fonts ----------------------------------------------------------
tap "homebrew/cask-fonts"
cask "font-alegreya"
cask "font-iosevka"
cask "font-iosevka-comfy"
cask "font-open-dyslexic"
cask "font-overpass"

# ---- Approximate nix-darwin services ---------------------------------
brew "eternal-terminal"
# ⚠️ jankyborders -> manual install from felixkratz GitHub
brew "netbird"
brew "tailscale"
brew "postgresql"
# ⚠️ sketchybar -> present via tap felixkratz/formulae
# ⚠️ mopidy, spotifyd -> optional
brew "dockutil"
brew "duti"
brew "swift-format"
